konsgn/MKL27_Arduino/boards.txt
# Copyright (c) 2016 Konstantin.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


# Arduino/ChARM0.2 (Small format- options)
# ---------------------------------------
menu.usb=USB Type
#menu.speed=CPU Speed
menu.rprotect=Program Read Protect

ChARM03.name=Cheap ARM v03 (ChARMbeta)

ChARM03.upload.tool=blhost
ChARM03.upload.protocol=
ChARM03.upload.maximum_size=64000
ChARM03.upload.use_1200bps_touch=false
ChARM03.upload.wait_for_upload_port=false
ChARM03.upload.native_usb=false
ChARM03.build.mcu=cortex-m0plus
ChARM03.build.f_cpu=48000000L
ChARM03.build.usb_product="MKL27 ChARM_Beta"
ChARM03.build.usb_manufacturer="KONSGN"
ChARM03.build.board=ChARM_0.3
ChARM03.build.core=MKL27
ChARM03.build.ldscript=MKL27Z64xxx4_flash.ld
ChARM03.build.variant=ChARM_0.3
ChARM03.build.variant_system_lib=
ChARM03.bootloader.tool=openocd   //rom bootloader

ChARM03.menu.usb.none=None 
ChARM03.menu.usb.none.build.usbtype=USB_NONE
ChARM03.menu.usb.cdc=Serial 
ChARM03.menu.usb.cdc.build.usbtype=USB_SERIAL
ChARM03.menu.usb.cdc_hid=Serial + rawHID
ChARM03.menu.usb.cdc_hid.build.usbtype=USB_SERIAL_HID
#ChARM03.menu.usb.hid.fake_serial=teensy_gateway
#ChARM03.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
#ChARM03.menu.usb.serialhid.build.usbtype=USB_SERIAL_HID
#ChARM03.menu.usb.int_disk=Disk(Internal) + Keyboard
#ChARM03.menu.usb.int_disk.build.usbtype=USB_DISK
#ChARM03.menu.usb.int_disk.fake_serial=teensy_gateway
#ChARM03.menu.usb.int_disk.build.elfpatch=mktinyfat
#ChARM03.menu.usb.sd_disk=Disk(SD Card) + Keyboard
#ChARM03.menu.usb.sd_disk.build.usbtype=USB_DISK_SDFLASH
#ChARM03.menu.usb.sd_disk.fake_serial=teensy_gateway
#ChARM03.menu.usb.midi=MIDI
#ChARM03.menu.usb.midi.build.usbtype=USB_MIDI
#ChARM03.menu.usb.midi.fake_serial=teensy_gateway
ChARM03.menu.usb.rawhid=Raw HID
ChARM03.menu.usb.rawhid.build.usbtype=USB_RAWHID
#ChARM03.menu.usb.rawhid.fake_serial=teensy_gateway
#ChARM03.menu.usb.flightsim=Flight Sim Controls
#ChARM03.menu.usb.flightsim.build.usbtype=USB_FLIGHTSIM
#ChARM03.menu.usb.flightsim.fake_serial=teensy_gateway

ChARM03.menu.rprotect.off=Read Not Protected
ChARM03.menu.rprotect.off.build.rprotect=NPROTECT
ChARM03.menu.rprotect.on=Read Protected
ChARM03.menu.rprotect.on.build.rprotect=PROTECT

# Arduino/ChARM0.2 (Teensy2Style)
# ---------------------------------------
menu.usb=USB Type
#menu.speed=CPU Speed
menu.rprotect=Program Read Protect

ChARM02.name=Cheap ARM v02 (ChARMbeta)

ChARM02.upload.tool=blhost
ChARM02.upload.protocol=
ChARM02.upload.maximum_size=64000
ChARM02.upload.use_1200bps_touch=false
ChARM02.upload.wait_for_upload_port=false
ChARM02.upload.native_usb=false
ChARM02.build.mcu=cortex-m0plus
ChARM02.build.f_cpu=48000000L
ChARM02.build.usb_product="MKL27 ChARM_Beta"
ChARM02.build.usb_manufacturer="KONSGN"
ChARM02.build.board=ChARM_0.2
ChARM02.build.core=MKL27
ChARM02.build.ldscript=MKL27Z64xxx4_flash.ld
ChARM02.build.variant=ChARM_0.2
ChARM02.build.variant_system_lib=
ChARM02.bootloader.tool=openocd   //rom bootloader

ChARM02.menu.usb.none=None 
ChARM02.menu.usb.none.build.usbtype=USB_NONE
ChARM02.menu.usb.cdc=Serial 
ChARM02.menu.usb.cdc.build.usbtype=USB_SERIAL
ChARM02.menu.usb.cdc_hid=Serial + rawHID
ChARM02.menu.usb.cdc_hid.build.usbtype=USB_SERIAL_HID
#ChARM02.menu.usb.hid.fake_serial=teensy_gateway
#ChARM02.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
#ChARM02.menu.usb.serialhid.build.usbtype=USB_SERIAL_HID
#ChARM02.menu.usb.int_disk=Disk(Internal) + Keyboard
#ChARM02.menu.usb.int_disk.build.usbtype=USB_DISK
#ChARM02.menu.usb.int_disk.fake_serial=teensy_gateway
#ChARM02.menu.usb.int_disk.build.elfpatch=mktinyfat
#ChARM02.menu.usb.sd_disk=Disk(SD Card) + Keyboard
#ChARM02.menu.usb.sd_disk.build.usbtype=USB_DISK_SDFLASH
#ChARM02.menu.usb.sd_disk.fake_serial=teensy_gateway
#ChARM02.menu.usb.midi=MIDI
#ChARM02.menu.usb.midi.build.usbtype=USB_MIDI
#ChARM02.menu.usb.midi.fake_serial=teensy_gateway
ChARM02.menu.usb.rawhid=Raw HID
ChARM02.menu.usb.rawhid.build.usbtype=USB_RAWHID
#ChARM02.menu.usb.rawhid.fake_serial=teensy_gateway
#ChARM02.menu.usb.flightsim=Flight Sim Controls
#ChARM02.menu.usb.flightsim.build.usbtype=USB_FLIGHTSIM
#ChARM02.menu.usb.flightsim.fake_serial=teensy_gateway

ChARM02.menu.rprotect.off=Read Not Protected
ChARM02.menu.rprotect.off.build.rprotect=NPROTECT
ChARM02.menu.rprotect.on=Read Protected
ChARM02.menu.rprotect.on.build.rprotect=PROTECT



#   # Arduino/Genuino Zero (Native USB Port)
#   # ---------------------------------------
#   arduino_zero_native.name=Arduino/Genuino Zero (Native USB Port)
#   arduino_zero_native.vid.0=0x2341
#   arduino_zero_native.pid.0=0x804d
#   arduino_zero_native.vid.1=0x2341
#   arduino_zero_native.pid.1=0x004d

#   arduino_zero_native.vid.2=0x2341
#   arduino_zero_native.pid.2=0x824d
#   # If the board is a 2341:824d use 2341:824d for build and set other parameters as well
#   arduino_zero_native.vid.2.build.vid=0x2341
#   arduino_zero_native.vid.2.build.pid=0x824d
#   arduino_zero_native.vid.2.build.usb_product="Genuino Zero"
#   arduino_zero_native.vid.2.bootloader.file=zero/samd21_sam_ba_genuino.bin

#   arduino_zero_native.vid.3=0x2341
#   arduino_zero_native.pid.3=0x024d
#   # If the board is a 2341:024d use 2341:824d for build and set other parameters as well
#   arduino_zero_native.vid.3.build.vid=0x2341
#   arduino_zero_native.vid.3.build.pid=0x824d
#   arduino_zero_native.vid.3.build.usb_product="Genuino Zero"
#   arduino_zero_native.vid.3.bootloader.file=zero/samd21_sam_ba_genuino.bin

#   arduino_zero_native.upload.tool=bossac
#   arduino_zero_native.upload.protocol=sam-ba
#   arduino_zero_native.upload.maximum_size=262144
#   arduino_zero_native.upload.use_1200bps_touch=true
#   arduino_zero_native.upload.wait_for_upload_port=true
#   arduino_zero_native.upload.native_usb=true
#   arduino_zero_native.build.mcu=cortex-m0plus
#   arduino_zero_native.build.f_cpu=48000000L
#   arduino_zero_native.build.usb_product="Arduino Zero"
#   arduino_zero_native.build.usb_manufacturer="Arduino LLC"
#   arduino_zero_native.build.board=SAMD_ZERO
#   arduino_zero_native.build.core=arduino
#   arduino_zero_native.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
#   arduino_zero_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
#   arduino_zero_native.build.openocdscript=openocd_scripts/arduino_zero.cfg
#   arduino_zero_native.build.variant=arduino_zero
#   arduino_zero_native.build.variant_system_lib=
#   arduino_zero_native.build.vid=0x2341
#   arduino_zero_native.build.pid=0x804d
#   arduino_zero_native.bootloader.tool=openocd
#   arduino_zero_native.bootloader.file=zero/samd21_sam_ba.bin

#   # Arduino/Genuino MKR1000
#   # ---------------------------------------
#   mkr1000.name=Arduino/Genuino MKR1000
#   mkr1000.vid.0=0x2341
#   mkr1000.pid.0=0x804e
#   mkr1000.vid.1=0x2341
#   mkr1000.pid.1=0x004e

#   mkr1000.vid.2=0x2341
#   mkr1000.pid.2=0x824e
#   # If the board is a 2341:824e use 2341:824e for build and set other parameters as well
#   mkr1000.vid.2.build.vid=0x2341
#   mkr1000.vid.2.build.pid=0x824e
#   mkr1000.vid.2.build.usb_product="Genuino MKR1000"
#   mkr1000.vid.2.bootloader.file=mkr1000/samd21_sam_ba_genuino_mkr1000.bin

#   mkr1000.vid.3=0x2341
#   mkr1000.pid.3=0x024e
#   # If the board is a 2341:024e use 2341:824e for build and set other parameters as well
#   mkr1000.vid.3.build.vid=0x2341
#   mkr1000.vid.3.build.pid=0x824e
#   mkr1000.vid.3.build.usb_product="Genuino MKR1000"
#   mkr1000.vid.3.bootloader.file=mkr1000/samd21_sam_ba_genuino_mkr1000.bin

#   mkr1000.upload.tool=bossac
#   mkr1000.upload.protocol=sam-ba
#   mkr1000.upload.maximum_size=262144
#   mkr1000.upload.use_1200bps_touch=true
#   mkr1000.upload.wait_for_upload_port=true
#   mkr1000.upload.native_usb=true
#   mkr1000.build.mcu=cortex-m0plus
#   mkr1000.build.f_cpu=48000000L
#   mkr1000.build.usb_product="Arduino MKR1000"
#   mkr1000.build.usb_manufacturer="Arduino LLC"
#   mkr1000.build.board=SAMD_MKR1000
#   mkr1000.build.core=arduino
#   mkr1000.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
#   mkr1000.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
#   mkr1000.build.openocdscript=openocd_scripts/arduino_zero.cfg
#   mkr1000.build.variant=mkr1000
#   mkr1000.build.vid=0x2341
#   mkr1000.build.pid=0x804e
#   mkr1000.bootloader.tool=openocd
#   mkr1000.bootloader.file=mkr1000/samd21_sam_ba_arduino_mkr1000.bin
